Австралия/src/DataProcessors/ApplicationLock/ApplicationLock.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ApplicationLock</name>
  <attributes>
    <name>DisableUserAuthorisation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisableScheduledJobs</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnlockCode</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LockEffectiveFrom</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LockEffectiveTo</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageForUsers</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Австралия/src/DataProcessors/ApplicationLock/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Locks or unlocks the infobase, depending on the data processor attribute values.
// 
//
Procedure SetLock() Export
	
	ExecuteSetLock(DisableUserAuthorisation);
	
EndProcedure

// Disables the previously enabled session lock.
//
Procedure CancelLock() Export
	
	ExecuteSetLock(False);
	
EndProcedure

// Reads the infobase lock parameters and passes them to the data processor attributes.
// 
//
Procedure GetLockParameters() Export
	
	If Users.IsFullUser(, True) Then
		CurrentMode = GetSessionsLock();
		UnlockCode = CurrentMode.KeyCode;
	Else
		CurrentMode = IBConnections.GetDataAreaSessionLock();
	EndIf;
	
	DisableUserAuthorisation = CurrentMode.Use 
		AND (Not ValueIsFilled(CurrentMode.End) Or CurrentSessionDate() < CurrentMode.End);
	MessageForUsers = IBConnectionsClientServer.ExtractLockMessage(CurrentMode.Message);
	
	If DisableUserAuthorisation Then
		LockEffectiveFrom    = CurrentMode.Begin;
		LockEffectiveTo = CurrentMode.End;
	Else
		// If data lock is not set, most probably the form is opened by user in order to set the lock.
		// 
		// Therefore making lock date equal to the current date.
		LockEffectiveFrom     = BegOfMinute(CurrentSessionDate() + 5 * 60);
	EndIf;
	
EndProcedure

Procedure ExecuteSetLock(Value)
	
	If Users.IsFullUser(, True) Then
		Lock = New SessionsLock;
		Lock.KeyCode    = UnlockCode;
	Else
		Lock = IBConnections.NewConnectionLockParameters();
	EndIf;
	
	Lock.Begin           = LockEffectiveFrom;
	Lock.End            = LockEffectiveTo;
	Lock.Message        = IBConnections.GenerateLockMessage(MessageForUsers, 
		UnlockCode); 
	Lock.Use      = Value;
	
	If Users.IsFullUser(, True) Then
		SetSessionsLock(Lock);
	Else
		IBConnections.SetDataAreaSessionLock(Lock);
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
